# ####################################################################

#  Created by Genus(TM) Synthesis Solution 20.11-s111_1 on Thu Apr 16 13:53:02 IST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design pe64_top

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_transition 0.1 [get_clocks clk]
set_load -pin_load 0.05 [get_ports {q[5]}]
set_load -pin_load 0.05 [get_ports {q[4]}]
set_load -pin_load 0.05 [get_ports {q[3]}]
set_load -pin_load 0.05 [get_ports {q[2]}]
set_load -pin_load 0.05 [get_ports {q[1]}]
set_load -pin_load 0.05 [get_ports {q[0]}]
set_load -pin_load 0.05 [get_ports v]
set_load -pin_load 0.05 [get_ports scan_out]
set_false_path -from [list \
  [get_ports scan_en]  \
  [get_ports scan_in] ]
set_false_path -to [get_ports scan_out]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[63]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[62]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[61]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[60]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[59]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[58]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[57]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[56]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[55]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[54]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[53]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[52]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[51]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[50]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[49]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[48]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[47]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[46]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[45]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[44]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[43]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[42]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[41]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[40]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[39]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[38]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[37]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[36]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[35]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[34]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[33]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[32]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {d[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports enable]
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports rst_n]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports scan_in]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports scan_en]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {q[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {q[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {q[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {q[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {q[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {q[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports v]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports scan_out]
set_operating_conditions -library slow slow
set_max_leakage_power 0.0
set_max_dynamic_power 0.0
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports enable]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[63]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[62]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[61]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[60]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[59]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[58]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[57]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[56]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[55]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[54]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[53]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[52]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[51]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[50]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[49]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[48]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[47]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[46]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[45]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[44]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[43]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[42]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[41]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[40]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[39]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[38]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[37]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[36]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[35]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[34]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[33]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[32]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[31]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[30]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[29]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[28]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[27]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[26]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[25]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[24]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[23]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[22]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[21]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[20]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[19]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[18]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[17]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[16]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[15]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[14]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[13]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[12]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[11]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[10]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[9]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[8]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[7]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[6]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[5]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[4]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[3]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[2]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[1]}]
set_driving_cell -lib_cell INVX1 -library slow -pin "Y" [get_ports {d[0]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.3 [get_clocks clk]
set_clock_uncertainty -hold 0.1 [get_clocks clk]
